** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.76.query.scm")
  ;; Test
  (for-each mc-eval
            (list '(and (append-to-form (1 2) (3 4) ?x)
                        (append-to-form (1) ?y ?x))
                  '(and (job ?supervisor ?supervisor-job)
                        (supervisor ?name ?supervisor)
                        (not (job ?supervisor (computer . ?job))))
                  '(and (salary ?name ?salary)
                        (salary (Bitdiddle Ben) ?ben-salary)
                        (lisp-value > ?ben-salary ?salary))))
#+end_src

#+RESULTS:
#+begin_example

;;; Query results:
(Merging frame streams)
(and (append-to-form (1 2) (3 4) (1 2 3 4)) (append-to-form (1) (2 3 4) (1 2 3 4)))
;;; Query results:
(and (job (scrooge eben) (accounting chief accountant)) (supervisor (cratchet robert) (scrooge eben)) (not (job (scrooge eben) (computer . ?job))))
(and (job (warbucks oliver) (administration big wheel)) (supervisor (aull dewitt) (warbucks oliver)) (not (job (warbucks oliver) (computer . ?job))))
(and (job (warbucks oliver) (administration big wheel)) (supervisor (scrooge eben) (warbucks oliver)) (not (job (warbucks oliver) (computer . ?job))))
(and (job (warbucks oliver) (administration big wheel)) (supervisor (bitdiddle ben) (warbucks oliver)) (not (job (warbucks oliver) (computer . ?job))))
;;; Query results:
(and (salary (aull dewitt) 25000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 25000))
(and (salary (cratchet robert) 18000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 18000))
(and (salary (reasoner louis) 30000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 30000))
(and (salary (tweakit lem e) 25000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 25000))
(and (salary (fect cy d) 35000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 35000))
(and (salary (hacker alyssa p) 40000) (salary (bitdiddle ben) 60000) (lisp-value > 60000 40000))
#+end_example
